{
  "fetchedAt": "2025-11-30T05:44:22.336Z",
  "items": [
    {
      "id": "https://medium.com/p/432f12d31edc",
      "title": "What is Lunor Labs",
      "link": "https://medium.com/@yasith.banula06/what-is-lunor-labs-432f12d31edc?source=rss-e516f5439b70------2",
      "date": "2025-11-30T05:39:58.000Z",
      "excerpt": "undefined...",
      "content": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*uR7mAKEA5LJLbGX3V8dz5Q.jpeg\" /></figure><p>Lunor Labs is a forward-thinking software engineering and product innovation company based in Sri Lanka. The company focuses on building modern, scalable, and impactful digital solutions that empower businesses and deliver meaningful user experiences.</p><p>With a strong culture of creativity, engineering excellence, and continuous learning, Lunor Labs brings together talented individuals to develop applications across full-stack development, cloud technologies, mobile engineering, AI integrations, and digital transformation.</p><p>The team at Lunor Labs is passionate about:<br> ✔ Crafting high-quality software<br> ✔ Solving real-world business challenges<br> ✔ Exploring new technologies<br> ✔ Delivering products with performance, reliability, and modern design</p><p>Lunor Labs is steadily growing into a space where young engineers and creators can contribute, collaborate, and build innovative digital products that shape the future.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=432f12d31edc\" width=\"1\" height=\"1\" alt=\"\">",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*uR7mAKEA5LJLbGX3V8dz5Q.jpeg",
      "tags": []
    },
    {
      "id": "https://medium.com/p/c9f09b263c1e",
      "title": "Banula",
      "link": "https://medium.com/@yasith.banula06/banula-c9f09b263c1e?source=rss-e516f5439b70------2",
      "date": "2025-11-25T10:14:40.000Z",
      "excerpt": "undefined...",
      "content": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GejoS1iZ6Z2eNlMgTt7x2A.jpeg\" /></figure><p>I enjoy finding issues, improving user experience, and making software more reliable. QA allows me to use both analytical and technical skills, and I like ensuring the final product is high quality.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=c9f09b263c1e\" width=\"1\" height=\"1\" alt=\"\">",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*GejoS1iZ6Z2eNlMgTt7x2A.jpeg",
      "tags": [
        "quality-assurance"
      ]
    },
    {
      "id": "https://medium.com/p/394093f4472b",
      "title": "Yasith Banula Medium",
      "link": "https://medium.com/@yasith.banula06/yasith-394093f4472b?source=rss-e516f5439b70------2",
      "date": "2025-11-25T10:04:33.000Z",
      "excerpt": "undefined...",
      "content": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/736/1*bqU-issIXLZe5rmySfSYjw.jpeg\" /></figure><p>Hi, I’m Yasith. I’m currently studying Computing and Information Systems at Sabaragamuwa University of Sri Lanka. I’m really interested in starting my career in Quality Assurance and I have contributed to manual testing and automation using Selenium, Java, TestNG, and Maven. I’ve also worked with Postman for API testing and SQL for database checks. I’m very excited for this opportunity</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=394093f4472b\" width=\"1\" height=\"1\" alt=\"\">",
      "thumbnail": "https://cdn-images-1.medium.com/max/736/1*bqU-issIXLZe5rmySfSYjw.jpeg",
      "tags": []
    },
    {
      "id": "https://medium.com/p/c37a1b7dc765",
      "title": "Top Universities in Sri Lanka for Tech Enthusiasts in 2025",
      "link": "https://medium.com/@yasith.banula06/top-universities-in-sri-lanka-for-tech-enthusiasts-in-2025-c37a1b7dc765?source=rss-e516f5439b70------2",
      "date": "2025-05-25T06:54:53.000Z",
      "excerpt": "undefined...",
      "content": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GL_MmSetmwgcm5B7rmWghA.jpeg\" /><figcaption><strong>Sabaragamuwa University of Sri Lanka</strong></figcaption></figure><p>In recent years, Sri Lanka has rapidly become a rising hub for technology education in South Asia. With a growing demand for skilled software engineers, data scientists, and IT professionals, Sri Lankan universities are stepping up to offer cutting-edge programs in tech and innovation. If you’re a student passionate about technology and innovation, here’s a list of the top universities in Sri Lanka to watch in 2025.</p><h3>1. University of Moratuwa</h3><p>The University of Moratuwa remains at the forefront of engineering and technology education in Sri Lanka. With its robust Department of Computer Science and Engineering, students here are exposed to both theoretical foundations and practical, industry-ready skills. The university also maintains strong ties with the tech industry, offering excellent internship and research opportunities.</p><h3>2. University of Colombo — School of Computing</h3><p>The University of Colombo’s School of Computing (UCSC) offers one of the most prestigious computer science programs in the country. It consistently ranks high in research output, software development, and international collaborations. Programs include specialized tracks in AI, cybersecurity, and data science.</p><h3>3. Sabaragamuwa University of Sri Lanka</h3><p>Located in the scenic Belihuloya region, Sabaragamuwa University has grown significantly in its reputation for STEM education. The Faculty of Applied Sciences offers modern ICT and computing programs tailored for future tech professionals.</p><p><a href=\"https://www.sab.ac.lk/\"><strong>Sabaragamuwa University of Sri Lanka</strong></a><strong> offers innovative ICT and science programs </strong><a href=\"https://www.sab.ac.lk/\"><strong>visit here</strong></a><strong> to learn more.</strong></p><p>With a strong focus on both academic excellence and real-world application, SAB provides students with the tools and mentorship needed to succeed in today’s digital economy.</p><h3>4. Sri Lanka Institute of Information Technology (SLIIT)</h3><p>SLIIT has made a name for itself by being one of the most dynamic and industry-focused private institutions in the region. With its comprehensive programs in software engineering, data analytics, and IT management, SLIIT graduates are in high demand by local and international employers.</p><h3>5. University of Peradeniya — Faculty of Engineering</h3><p>The University of Peradeniya brings together tradition and innovation. Its Department of Electrical and Electronic Engineering provides a solid foundation in embedded systems, machine learning, and computer networks. The serene campus environment also makes it an excellent place for deep academic focus.</p><h3>Final Thoughts</h3><p>Sri Lanka’s tech education landscape is evolving rapidly, and students now have more choices than ever to pursue careers in software, AI, robotics, and other future-forward fields. Whether you’re looking for research excellence, modern labs, or industry partnerships, these universities provide strong platforms for launching a successful career in technology.</p><p>If you’re planning to begin your tech journey in 2025, keep these institutions on your radar!</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=c37a1b7dc765\" width=\"1\" height=\"1\" alt=\"\">",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*GL_MmSetmwgcm5B7rmWghA.jpeg",
      "tags": []
    }
  ]
}